joristork/robots/jobot_in_c/microchip_extras/h/p18lf25k80.h
extern volatile far  unsigned char       B0EIDH;
extern volatile far  union {
  struct {
    unsigned EID:8;
  };
  struct {
    unsigned EID8:1;
    unsigned EID9:1;
    unsigned EID10:1;
    unsigned EID11:1;
    unsigned EID12:1;
    unsigned EID13:1;
    unsigned EID14:1;
    unsigned EID15:1;
  };
} B0EIDHbits;
extern volatile far  unsigned char       B0EIDL;
extern volatile far  union {
  struct {
    unsigned EID:8;
  };
  struct {
    unsigned EID0:1;
    unsigned EID1:1;
    unsigned EID2:1;
    unsigned EID3:1;
    unsigned EID4:1;
    unsigned EID5:1;
    unsigned EID6:1;
    unsigned EID7:1;
  };
} B0EIDLbits;
extern volatile far  unsigned char       B0DLC;
extern volatile far  union {
  struct {
    unsigned DLC:4;
    unsigned RB:2;
    unsigned RXRTR_TXRTR:1;
  };
  struct {
    unsigned DLC0:1;
    unsigned DLC1:1;
    unsigned DLC2:1;
    unsigned DLC3:1;
    unsigned RB0:1;
    unsigned RB1:1;
    unsigned RXRTR:1;
  };
  struct {
    unsigned :6;
    unsigned TXRTR:1;
  };
} B0DLCbits;
extern volatile far  unsigned char       B0D0;
extern volatile far  union {
  struct {
    unsigned B0D0:8;
  };
  struct {
    unsigned B0D00:1;
    unsigned B0D01:1;
    unsigned B0D02:1;
    unsigned B0D03:1;
    unsigned B0D04:1;
    unsigned B0D05:1;
    unsigned B0D06:1;
    unsigned B0D07:1;
  };
} B0D0bits;
extern volatile far  unsigned char       B0D1;
extern volatile far  union {
  struct {
    unsigned B0D1:8;
  };
  struct {
    unsigned B0D10:1;
    unsigned B0D11:1;
    unsigned B0D12:1;
    unsigned B0D13:1;
    unsigned B0D14:1;
    unsigned B0D15:1;
    unsigned B0D16:1;
    unsigned B0D17:1;
  };
} B0D1bits;
extern volatile far  unsigned char       B0D2;
extern volatile far  union {
  struct {
    unsigned B0D2:8;
  };
  struct {
    unsigned B0D20:1;
    unsigned B0D21:1;
    unsigned B0D22:1;
    unsigned B0D23:1;
    unsigned B0D24:1;
    unsigned B0D25:1;
    unsigned B0D26:1;
    unsigned B0D27:1;
  };
} B0D2bits;
extern volatile far  unsigned char       B0D3;
extern volatile far  union {
  struct {
    unsigned B0D3:8;
  };
  struct {
    unsigned B0D30:1;
    unsigned B0D31:1;
    unsigned B0D32:1;
    unsigned B0D33:1;
    unsigned B0D34:1;
    unsigned B0D35:1;
    unsigned B0D36:1;
    unsigned B0D37:1;
  };
} B0D3bits;
extern volatile far  unsigned char       B0D4;
extern volatile far  union {
  struct {
    unsigned B0D4:8;
  };
  struct {
    unsigned B0D40:1;
    unsigned B0D41:1;
    unsigned B0D42:1;
    unsigned B0D43:1;
    unsigned B0D44:1;
    unsigned B0D45:1;
    unsigned B0D46:1;
    unsigned B0D47:1;
  };
} B0D4bits;
extern volatile far  unsigned char       B0D5;
extern volatile far  union {
  struct {
    unsigned B0D5:8;
  };
  struct {
    unsigned B0D50:1;
    unsigned B0D51:1;
    unsigned B0D52:1;
    unsigned B0D53:1;
    unsigned B0D54:1;
    unsigned B0D55:1;
    unsigned B0D56:1;
    unsigned B0D57:1;
  };
} B0D5bits;
extern volatile far  unsigned char       B0D6;
extern volatile far  union {
  struct {
    unsigned B0D6:8;
  };
  struct {
    unsigned B0D60:1;
    unsigned B0D61:1;
    unsigned B0D62:1;
    unsigned B0D63:1;
    unsigned B0D64:1;
    unsigned B0D65:1;
    unsigned B0D66:1;
    unsigned B0D67:1;
  };
} B0D6bits;
extern volatile far  unsigned char       B0D7;
extern volatile far  union {
  struct {
    unsigned B0D7:8;
  };
  struct {
    unsigned B0D70:1;
    unsigned B0D71:1;
    unsigned B0D72:1;
    unsigned B0D73:1;
    unsigned B0D74:1;
    unsigned B0D75:1;
    unsigned B0D76:1;
    unsigned B0D77:1;
  };
} B0D7bits;
extern volatile far  unsigned char       CANSTAT_RO9;
extern volatile far  union {
  struct {
    unsigned EICODE0:1;
    unsigned EICODE1_ICODE0:1;
    unsigned EICODE2_ICODE1:1;
    unsigned EICODE3_ICODE2:1;
    unsigned EICODE4:1;
    unsigned OPMODE:3;
  };
  struct {
    unsigned :1;
    unsigned EICODE1:1;
    unsigned EICODE2:1;
    unsigned EICODE3:1;
    unsigned :1;
    unsigned OPMODE0:1;
    unsigned OPMODE1:1;
    unsigned OPMODE2:1;
  };
  struct {
    unsigned :1;
    unsigned ICODE0:1;
    unsigned ICODE1:1;
    unsigned ICODE2:1;
  };
} CANSTAT_RO9bits;
extern volatile far  unsigned char       CANCON_RO9;
extern volatile far  union {
  struct {
    unsigned FP0:1;
    unsigned WIN0_FP1:1;
    unsigned WIN1_FP2:1;
    unsigned WIN2_FP3:1;
    unsigned ABAT:1;
    unsigned REQOP:3;
  };
  struct {
    unsigned :1;
    unsigned WIN0:1;
    unsigned WIN1:1;
    unsigned WIN2:1;
  };
  struct {
    unsigned :1;
    unsigned FP1:1;
    unsigned FP2:1;
    unsigned FP3:1;
  };
} CANCON_RO9bits;
extern volatile far  unsigned char       B1CON;
extern volatile far  union {
  struct {
    unsigned FILHIT0_TXPRI0:1;
    unsigned FILHIT1_TXPRI1:1;
    unsigned FILHIT2_RTREN:1;
    unsigned FILHIT3_TXREQ:1;
    unsigned FILHIT4_TXERR:1;
    unsigned RXRTRRO_TXLARB:1;
    unsigned RXM1_TXABT:1;
    unsigned RXFUL_TXBIF:1;
  };
  struct {
    unsigned FILHIT0:1;
    unsigned FILHIT1:1;
    unsigned FILHIT2:1;
    unsigned FILHIT3:1;
    unsigned FILHIT4:1;
    unsigned RXRTRRO:1;
    unsigned RXM1:1;
    unsigned RXFUL:1;
  };
  struct {
    unsigned TXPRI0:1;
    unsigned TXPRI1:1;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABT:1;
    unsigned TXBIF:1;
  };
} B1CONbits;
extern volatile far  unsigned char       B1SIDH;
extern volatile far  union {
  struct {
    unsigned SID:8;
  };
  struct {
    unsigned SID3:1;
    unsigned SID4:1;
    unsigned SID5:1;
    unsigned SID6:1;
    unsigned SID7:1;
    unsigned SID8:1;
    unsigned SID9:1;
    unsigned SID10:1;
  };
} B1SIDHbits;
extern volatile far  unsigned char       B1SIDL;
extern volatile far  union {
  struct {
    unsigned EID:2;
    unsigned :1;
    unsigned EXIDE:1;
    unsigned SRR:1;
    unsigned SID:3;
  };
  struct {
    unsigned EID16:1;
    unsigned EID17:1;
    unsigned :3;
    unsigned SID0:1;
    unsigned SID1:1;
    unsigned SID2:1;
  };
} B1SIDLbits;
extern volatile far  unsigned char       B1EIDH;
extern volatile far  union {
  struct {
    unsigned EID:8;
  };
  struct {
    unsigned EID8:1;
    unsigned EID9:1;
    unsigned EID10:1;
    unsigned EID11:1;
    unsigned EID12:1;
    unsigned EID13:1;
    unsigned EID14:1;
    unsigned EID15:1;
  };
} B1EIDHbits;
extern volatile far  unsigned char       B1EIDL;
extern volatile far  union {
  struct {
    unsigned EID:8;
  };
  struct {
    unsigned EID0:1;
    unsigned EID1:1;
    unsigned EID2:1;
    unsigned EID3:1;
    unsigned EID4:1;
    unsigned EID5:1;
    unsigned EID6:1;
    unsigned EID7:1;
  };
} B1EIDLbits;
extern volatile far  unsigned char       B1DLC;
extern volatile far  union {
  struct {
    unsigned DLC:4;
    unsigned RB:2;
    unsigned RXRTR_TXRTR:1;
  };
  struct {
    unsigned DLC0:1;
    unsigned DLC1:1;
    unsigned DLC2:1;
    unsigned DLC3:1;
    unsigned RB0:1;
    unsigned RB1:1;
    unsigned RXRTR:1;
  };
  struct {
    unsigned :6;
    unsigned TXRTR:1;
  };
} B1DLCbits;
extern volatile far  unsigned char       B1D0;
extern volatile far  union {
  struct {
    unsigned B1D0:8;
  };
  struct {
    unsigned B1D00:1;
    unsigned B1D01:1;
    unsigned B1D02:1;
    unsigned B1D03:1;
    unsigned B1D04:1;
    unsigned B1D05:1;
    unsigned B1D06:1;
    unsigned B1D07:1;
  };
} B1D0bits;
extern volatile far  unsigned char       B1D1;
extern volatile far  union {
  struct {
    unsigned B1D1:8;
  };
  struct {
    unsigned B1D10:1;
    unsigned B1D11:1;
    unsigned B1D12:1;
    unsigned B1D13:1;
    unsigned B1D14:1;
    unsigned B1D15:1;
    unsigned B1D16:1;
    unsigned B1D17:1;
  };
} B1D1bits;
extern volatile far  unsigned char       B1D2;
extern volatile far  union {
  struct {
    unsigned B1D2:8;
  };
  struct {
    unsigned B1D20:1;
    unsigned B1D21:1;
    unsigned B1D22:1;
    unsigned B1D23:1;
    unsigned B1D24:1;
    unsigned B1D25:1;
    unsigned B1D26:1;
    unsigned B1D27:1;
  };
} B1D2bits;
