joristork/robots/jobot_in_c/microchip_extras/h/p18lf25k80.h
extern volatile far  unsigned char       TXB0D3;
extern volatile far  union {
  struct {
    unsigned TXB0D3:8;
  };
  struct {
    unsigned TXB0D30:1;
    unsigned TXB0D31:1;
    unsigned TXB0D32:1;
    unsigned TXB0D33:1;
    unsigned TXB0D34:1;
    unsigned TXB0D35:1;
    unsigned TXB0D36:1;
    unsigned TXB0D37:1;
  };
} TXB0D3bits;
extern volatile far  unsigned char       TXB0D4;
extern volatile far  union {
  struct {
    unsigned TXB0D4:8;
  };
  struct {
    unsigned TXB0D40:1;
    unsigned TXB0D41:1;
    unsigned TXB0D42:1;
    unsigned TXB0D43:1;
    unsigned TXB0D44:1;
    unsigned TXB0D45:1;
    unsigned TXB0D46:1;
    unsigned TXB0D47:1;
  };
} TXB0D4bits;
extern volatile far  unsigned char       TXB0D5;
extern volatile far  union {
  struct {
    unsigned TXB0D5:8;
  };
  struct {
    unsigned TXB0D50:1;
    unsigned TXB0D51:1;
    unsigned TXB0D52:1;
    unsigned TXB0D53:1;
    unsigned TXB0D54:1;
    unsigned TXB0D55:1;
    unsigned TXB0D56:1;
    unsigned TXB0D57:1;
  };
} TXB0D5bits;
extern volatile far  unsigned char       TXB0D6;
extern volatile far  union {
  struct {
    unsigned TXB0D6:8;
  };
  struct {
    unsigned TXB0D60:1;
    unsigned TXB0D61:1;
    unsigned TXB0D62:1;
    unsigned TXB0D63:1;
    unsigned TXB0D64:1;
    unsigned TXB0D65:1;
    unsigned TXB0D66:1;
    unsigned TXB0D67:1;
  };
} TXB0D6bits;
extern volatile far  unsigned char       TXB0D7;
extern volatile far  union {
  struct {
    unsigned TXB0D7:8;
  };
  struct {
    unsigned TXB0D70:1;
    unsigned TXB0D71:1;
    unsigned TXB0D72:1;
    unsigned TXB0D73:1;
    unsigned TXB0D74:1;
    unsigned TXB0D75:1;
    unsigned TXB0D76:1;
    unsigned TXB0D77:1;
  };
} TXB0D7bits;
extern volatile far  unsigned char       CANSTAT_RO1;
extern volatile far  union {
  struct {
    unsigned EICODE0:1;
    unsigned EICODE1_ICODE0:1;
    unsigned EICODE2_ICODE1:1;
    unsigned EICODE3_ICODE2:1;
    unsigned EICODE4:1;
    unsigned OPMODE:3;
  };
  struct {
    unsigned :1;
    unsigned EICODE1:1;
    unsigned EICODE2:1;
    unsigned EICODE3:1;
    unsigned :1;
    unsigned OPMODE0:1;
    unsigned OPMODE1:1;
    unsigned OPMODE2:1;
  };
  struct {
    unsigned :1;
    unsigned ICODE0:1;
    unsigned ICODE1:1;
    unsigned ICODE2:1;
  };
} CANSTAT_RO1bits;
extern volatile far  unsigned char       CANCON_RO1;
extern volatile far  union {
  struct {
    unsigned FP0:1;
    unsigned WIN0_FP1:1;
    unsigned WIN1_FP2:1;
    unsigned WIN2_FP3:1;
    unsigned ABAT:1;
    unsigned REQOP:3;
  };
  struct {
    unsigned :1;
    unsigned WIN0:1;
    unsigned WIN1:1;
    unsigned WIN2:1;
  };
  struct {
    unsigned :1;
    unsigned FP1:1;
    unsigned FP2:1;
    unsigned FP3:1;
  };
} CANCON_RO1bits;
extern volatile far  unsigned char       RXB1CON;
extern volatile far  union {
  struct {
    unsigned FILHIT0:1;
    unsigned FILHIT1:1;
    unsigned FILHIT2:1;
    unsigned RXRTRRO_FILHIT3:1;
    unsigned FILHIT4:1;
    unsigned RXM0_RTRRO:1;
    unsigned RXM1:1;
    unsigned RXFUL:1;
  };
  struct {
    unsigned :3;
    unsigned RXRTRRO:1;
    unsigned :1;
    unsigned RXM0:1;
  };
  struct {
    unsigned :3;
    unsigned FILHIT3:1;
    unsigned :1;
    unsigned RTRRO:1;
  };
} RXB1CONbits;
extern volatile far  unsigned char       RXB1SIDH;
extern volatile far  union {
  struct {
    unsigned SID:8;
  };
  struct {
    unsigned SID3:1;
    unsigned SID4:1;
    unsigned SID5:1;
    unsigned SID6:1;
    unsigned SID7:1;
    unsigned SID8:1;
    unsigned SID9:1;
    unsigned SID10:1;
  };
} RXB1SIDHbits;
extern volatile far  unsigned char       RXB1SIDL;
extern volatile far  union {
  struct {
    unsigned EID:2;
    unsigned :1;
    unsigned EXID:1;
    unsigned SRR:1;
    unsigned SID:3;
  };
  struct {
    unsigned EDI16:1;
    unsigned EDI17:1;
    unsigned :3;
    unsigned SID0:1;
    unsigned SID1:1;
    unsigned SID2:1;
  };
} RXB1SIDLbits;
extern volatile far  unsigned char       RXB1EIDH;
extern volatile far  union {
  struct {
    unsigned EID:8;
  };
  struct {
    unsigned EID8:1;
    unsigned EID9:1;
    unsigned EID10:1;
    unsigned EID11:1;
    unsigned EID12:1;
    unsigned EID13:1;
    unsigned EID14:1;
    unsigned EID15:1;
  };
} RXB1EIDHbits;
extern volatile far  unsigned char       RXB1EIDL;
extern volatile far  union {
  struct {
    unsigned EID:8;
  };
  struct {
    unsigned EID0:1;
    unsigned EID1:1;
    unsigned EID2:1;
    unsigned EID3:1;
    unsigned EID4:1;
    unsigned EID5:1;
    unsigned EID6:1;
    unsigned EID7:1;
  };
} RXB1EIDLbits;
extern volatile far  unsigned char       RXB1DLC;
extern volatile far  union {
  struct {
    unsigned DLC:4;
    unsigned RB:2;
    unsigned RXRTR:1;
  };
  struct {
    unsigned DLC0:1;
    unsigned DLC1:1;
    unsigned DLC2:1;
    unsigned DLC3:1;
    unsigned RB0:1;
    unsigned RB1:1;
  };
} RXB1DLCbits;
extern volatile far  unsigned char       RXB1D0;
extern volatile far  union {
  struct {
    unsigned RXB1D0:8;
  };
  struct {
    unsigned RXB1D00:1;
    unsigned RXB1D01:1;
    unsigned RXB1D02:1;
    unsigned RXB1D03:1;
    unsigned RXB1D04:1;
    unsigned RXB1D05:1;
    unsigned RXB1D06:1;
    unsigned RXB1D07:1;
  };
} RXB1D0bits;
extern volatile far  unsigned char       RXB1D1;
extern volatile far  union {
  struct {
    unsigned RXB1D1:8;
  };
  struct {
    unsigned RXB1D10:1;
    unsigned RXB1D11:1;
    unsigned RXB1D12:1;
    unsigned RXB1D13:1;
    unsigned RXB1D14:1;
    unsigned RXB1D15:1;
    unsigned RXB1D16:1;
    unsigned RXB1D17:1;
  };
} RXB1D1bits;
extern volatile far  unsigned char       RXB1D2;
extern volatile far  union {
  struct {
    unsigned RXB1D2:8;
  };
  struct {
    unsigned RXB1D20:1;
    unsigned RXB1D21:1;
    unsigned RXB1D22:1;
    unsigned RXB1D23:1;
    unsigned RXB1D24:1;
    unsigned RXB1D25:1;
    unsigned RXB1D26:1;
    unsigned RXB1D27:1;
  };
} RXB1D2bits;
extern volatile far  unsigned char       RXB1D3;
extern volatile far  union {
  struct {
    unsigned RXB1D3:8;
  };
  struct {
    unsigned RXB1D30:1;
    unsigned RXB1D31:1;
    unsigned RXB1D32:1;
    unsigned RXB1D33:1;
    unsigned RXB1D34:1;
    unsigned RXB1D35:1;
    unsigned RXB1D36:1;
    unsigned RXB1D37:1;
  };
} RXB1D3bits;
